app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (status LIKE 'Posted') ORDER BY date_posted desc LIMIT 10
---
  def latest
    @article = Article.recent(1).posts.first

SELECT * FROM `articles` ORDER BY articles.id DESC LIMIT 1
---
  def index
    @articles = Article.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def print
   @article = Article.find(params[:id])

INSERT INTO `articles` (`created_at`, `title`, `body`, `updated_at`, `date_posted`, `author_id`, `status`) VALUES('2010-04-20 03:51:35', 'Pegasus and the Unicorn Friends', '\"Hey, what about me,\" said Charlie.', '2010-04-20 03:51:35', '2010-04-20 11:48:00', 3, 'Posted')
---
  def create
    @article = Article.new({:author => current_author}.merge(params[:article]))
    if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 5)
UPDATE `articles` SET `updated_at` = '2010-05-13 08:56:57', `date_posted` = '2010-05-13 08:56:57', `body` = '<p>WOoohHooo</p>\r\n<p>So</p>\r\n<p>how</p>\r\n<p>do</p>\r\n<p>we</p>\r\n<p>do</p>\r\n<p>this</p>' WHERE `id` = 2
---
  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(params[:article])

SELECT * FROM `articles` WHERE (`articles`.author_id = 5)
DELETE FROM `articles` WHERE `id` = 5
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy