app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT * FROM `authors`

  def show
    @author = Author.find(params[:id])
---
SELECT * FROM `authors` WHERE (`authors`.`id` = '5') LIMIT 1

  def edit
    @author = Author.find(params[:id])
---
SELECT * FROM `authors` WHERE (`authors`.`id` = '5') LIMIT 1

  def create
    @author = Author.new(params[:author])
    if @author.save
---
INSERT INTO `authors` (`remarks`, `created_at`, `single_access_token`, `crypted_password`, `updated_at`, `perishable_token`, `password_salt`, `last_name`, `birthday`, `persistence_token`, `login`, `first_name`, `email`) VALUES('Hello po', '2010-04-20 06:35:22', 'QkDar2Ji3xKF2rBNe4rS', 'b70e34892beb5f49de0afadfeaee1c3ab12ed5212f0378053dc4f6231de2183e84d1b5e36d7e28c994b8071aeb7f0f2925c5984306405a9ee68f228a55961df1', '2010-04-20 06:35:22', 'UvSh6zhocChM5MvQznw1', 'HON_Wggtrh2bmrEM244s', 'Suarez', '2011-11-11', 'f88d1d892842f945a2d769d02144df95765b109134d81e1f8e6cebdbcb59e08e4ea78ce49e8f0464d3c0385dca0b3dfc647e0c3fe8017b5430a16b657f035e37', 'pegasusman', 'Alejandro', 'amboysuareziii@gmail.com')

  def update
    @author = Author.find(params[:id])
    if @author.update_attributes(params[:author])
---
SELECT * FROM `authors` WHERE (`authors`.`id` = '5') LIMIT 1
UPDATE `authors` SET `updated_at` = '2010-04-20 10:49:47', `login` = 'dugsdugsdugs', `crypted_password` = 'a4884c72855e2d5eb51f542c32a4aba5b80f3d257cea9835a7d110f31c37990d4b237ef812e8f9b5252b7cceb7c102825d2d06c327aa29f18c6a70fff6f9ffcf', `perishable_token` = 'xsm9xaiFNSsafubnkIBP', `single_access_token` = 'NR5T0Dps-K0MA7RDCNTL', `remarks` = '<p>Hello phowz. Cute you phowz.</p>', `email` = 'gcsdwolfram31199@yahoo.com', `password_salt` = 'RWD1M67kh1HwxCpZViOX', `persistence_token` = 'b68684665430818d3195b49020dd282dcb0389e28a0f6460fbb0e4fc8d3a027f3367e6f34fe6670ed18fb2558d0349dab2ee3e6635f73e99002c24ff272512ed' WHERE `id` = 4

  def destroy
    @author = Author.find(params[:id])
    @author.destroy
---
SELECT * FROM `authors` WHERE (`authors`.`id` = '5') LIMIT 1
DELETE FROM `authors` WHERE `id` = 2