app/controllers/comments_controller.rb

  def show
    @article = Article.find(params[:article_id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 4)

  def create
    @article = Article.find(params[:article_id])
    @comment = Comment.new(:article_id => @article.id)

    if @comment.save
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `article_id`, `comment_date`, `email`) VALUES('2010-04-19 07:55:22', 'h3lL0 pH0wZz!!!!!11', '2010-04-19 07:55:22', 2, '2010-04-19 07:55:05', 'badumbadum@yahoo.com')