app/controllers/ratings_controller.rb

  def like
    @rating = Rating.new(
      :article => Article.find(params[:article_id]),
      :author  => current_author,
      :liked   => true)
    @rating.save
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `authors` WHERE (`authors`.`id` = '1') LIMIT 1
SELECT `ratings`.id FROM `ratings` WHERE (`ratings`.`author_id` = 2) AND (((`ratings`.`liked` = 1) AND (`ratings`.article_id = 2)) AND (`ratings`.article_id = 2)) LIMIT 1
INSERT INTO `ratings` (`created_at`, `updated_at`, `liked`, `article_id`, `author_id`) VALUES('2010-05-13 01:16:16', '2010-05-13 01:16:16', 1, NULL, 1)

  def dislike
    @rating = Rating.new(
      :article => Article.find(params[:article_id]),
      :author  => current_author,
      :liked   => false)
    @rating.save
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `authors` WHERE (`authors`.`id` = '1') LIMIT 1
SELECT `ratings`.id FROM `ratings` WHERE (`ratings`.`author_id` = 2) AND (((`ratings`.`liked` = 1) AND (`ratings`.article_id = 2)) AND (`ratings`.article_id = 2)) LIMIT 1
INSERT INTO `ratings` (`created_at`, `updated_at`, `liked`, `article_id`, `author_id`) VALUES('2010-05-13 03:47:15', '2010-05-13 03:47:15', 0, 1, 1)

  def update
    @rating = Rating.find(
      :last, :conditions => { :article_id => params[:article_id],
                              :author_id => current_author.id } )
    @rating.liked = !@rating.liked
    @rating.save

    render :partial => 'ratings/form',
        :locals => {:rating => @rating, :article => Article.find(params[:article_id])}
---
SELECT * FROM `ratings` WHERE (`ratings`.`author_id` = 1 AND `ratings`.`article_id` = '1') ORDER BY ratings.id DESC LIMIT 1
UPDATE `ratings` SET `updated_at` = '2010-05-13 07:51:42', `liked` = 0 WHERE `id` = 23
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)

  def destroy
    @article = Article.find(params[:article_id])
    @rating = Rating.find(:last, :conditions => {:article_id => params[:article_id], :author_id => current_author.id})
    @rating.destroy
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `ratings` WHERE (`ratings`.`author_id` = 1 AND `ratings`.`article_id` = '1') ORDER BY ratings.id DESC LIMIT 1
DELETE FROM `ratings` WHERE `id` = 23